Данные для задачи расположены в архиве, тестовый сервер по ссылке http://52.200.49.43/2016/transport. В некотором городе N на каждом автобусе/троллейбусе/трамвае установлены GPS (или даже ГЛОНАСС) трекеры, которые с некоторым промежутком времени передают информацию о своем местоположении на специальный сервер.

Допустим, что данные для всех транспортных средства одного маршрута непрерывно записывались на протяжении недели, потом GPS координаты (широта и долгота) были спроецированы на плоскость с использованием проекции Меркатора и некоторого линейного преобразования. Эти данные записаны в файле train.txt в виде:

1447037729  <tab>  3054.619968  <tab>  2409.828279  <tab>  570d8
поля разделены табуляцией. Здесь:

1447037729 - UNIX-время, которое без труда можно преобразовать во что-то разумное с помощью стандартной библиотеки любимого языка программирования (Java, C#, Python, Go).
3054.619968 - координата "x"
2409.828279 - координата "y"
570d8 - уникальный идентификатор транспортного средства, от которого получен сигнал.
Задача состоит в определении координат остановок в одном направлении. Известно, что в этом направлении всего 39 остановок, первая имеет координаты:

(11038.08464497, 8253.17542416)
последняя:

(283.08479678, 163.45489494)
кроме того известно, что есть остановка с координатами:

(3425.67079005, 3469.94198377)
В тестовом файле должны быть координаты 37 промежуточных остановок (все, что между первой и последней), остановки должны быть упорядочены. Координаты задаются двумя вещественными числами, соответственно "x" и "y". Числа разделены табуляцией или пробелом, пример тестового файла в output_example.txt .

####Оценка результатов

За каждую неправильно определенную остановку засчитывается штраф, потом штрафы усредняется по всем остановкам - это и есть результат .

Формально, пусть известны точные координаты остановочных павильонов:

$$S = {(x_i, y_i)}_{i=1}^{37}$$

пусть предсказаны следующие координаты остановок:

$$\hat{S} = {(\hat{x_i}, \hat{y_i}}_{i=1}^{37}$$

тогда штраф считается по формуле:

$$\frac{1}{37}\sum_{i}^{37}f\big(\sqrt{(x_i - \hat{x_i}))^2 + (y_i - \hat{y_i})^2}\big)$$

где

$$f(x) = \begin{cases} 0 &\mbox{if } x \le 20 \ (x - 20)^2 & \mbox{if } x \gt 20 \end{cases} $$

То есть если оценка попадает в круг радиуса 20 от известных координат, то остановка считается угаданной верно. В противном случае начисляется штраф, равный квадрату расстояния от круга.
